; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (onbeltconveyor ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holdblock ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holdblock ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holdblock ?x)
	     :effect
	     (and (not (holdblock ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))

  (:action put-down-beltconveyor
	     :parameters (?x - block)
	     :precondition (holdblock ?x)
	     :effect
	     (and (not (holdblock ?x))
		   (clear ?x)
		   (handempty)
		   (onbeltconveyor ?x)))

  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holdblock ?x) (clear ?y))
	     :effect
	     (and (not (holdblock ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holdblock ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-4-0)
(:domain BLOCKS)
(:objects D B A C E - block)
(:INIT (CLEAR E) (ON E D) (ON D C) (ON C B) (ON B A) (ONTABLE A) (HANDEMPTY))
(:goal (AND (ON E C) (ON C A) (ONTABLE A) (ONBELTCONVEYOR B) (ONBELTCONVEYOR D))
))

; plan
1. (unstack e d)
   deleted: (clear e) (handempty) (on e d)
   added: (holdblock e) (clear d)
   goals met: 1 of 5
2. (put-down e)
   deleted: (holdblock e)
   added: (clear e) (handempty) (ontable e)
   goals met: 1 of 5
3. (unstack d c)
   deleted: (clear d) (handempty) (on d c)
   added: (holdblock d) (clear c)
   goals met: 1 of 5
4. (put-down-beltconveyor d)
   deleted: (holdblock d)
   added: (clear d) (handempty) (onbeltconveyor d)
   goals met: 2 of 5
5. (unstack c b)
   deleted: (clear c) (handempty) (on c b)
   added: (holdblock c) (clear b)
   goals met: 2 of 5
6. (put-down c)
   deleted: (holdblock c)
   added: (clear c) (handempty) (ontable c)
   goals met: 2 of 5
7. (unstack b a)
   deleted: (clear b) (handempty) (on b a)
   added: (holdblock b) (clear a)
   goals met: 2 of 5
8. (put-down-beltconveyor b)
   deleted: (holdblock b)
   added: (clear b) (handempty) (onbeltconveyor b)
   goals met: 3 of 5
9. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holdblock c)
   goals met: 3 of 5
10. (stack c a)
   deleted: (holdblock c) (clear a)
   added: (clear c) (handempty) (on c a)
   goals met: 4 of 5
11. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holdblock e)
   goals met: 4 of 5
12. (stack e c)
   deleted: (holdblock e) (clear c)
   added: (clear e) (handempty) (on e c)
   goals met: 5 of 5
